Adding this block where previously the `node_pools_oauth_scopes` was not specified:
```
...
  node_pools_oauth_scopes = {
    all = []

    super-secure-pool = [
      "https://www.googleapis.com/auth/logging.write",
      "https://www.googleapis.com/auth/monitoring.write",
      "https://www.googleapis.com/auth/trace.append",
      "https://www.googleapis.com/auth/devstorage.read_only"
    ]
  }
...
```

Causes the `main-pool`, which is the only node pool at the time terraform is run, to be recreated:
```
  # module.gke.google_container_node_pool.pools["main-pool"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                  = "<redacted>" -> (known after apply)
      ~ instance_group_urls = [
          - "<redacted",
        ] -> (known after apply)
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "main-pool"
      + name_prefix         = (known after apply)
      ~ node_count          = 3 -> (known after apply)
      ~ node_locations      = [
          - "us-central1-b",
        ] -> (known after apply)
      ~ version             = "1.18.17-gke.700" -> (known after apply)
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> (known after apply) # forces replacement
            tags              = [
                "gke-online-boutique-demo",
                "gke-online-boutique-demo-main-pool",
            ]
          ~ taint             = [] -> (known after apply)
            # (10 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }
```
